#include "menu.h"
#include<iostream>
void Menu::clearScreen() {
	system("cls");
}
void Menu::wait() {

}
void Menu::mainMenu(){
	system("cls");
	std::cout << "######################################\n";
	std::cout << "#               无尽迷宫             #\n";
	std::cout << "######################################\n";
	std::cout << "#             1.开始游戏             #\n";
	std::cout << "######################################\n";
	std::cout << "#             2.设    置             #\n";
	std::cout << "######################################\n";
	std::cout << "#             0.退    出             #\n";
	std::cout << "######################################\n";
	std::cout << "请输入  >";
}
void Menu::settingMenu() {
	system("cls");
	std::cout << "######################################\n";
	std::cout << "#               设    置             #\n";
	std::cout << "######################################\n";
	std::cout << "#             1.游戏规则             #\n";
	std::cout << "######################################\n";
	std::cout << "#             2.作者说明             #\n";
	std::cout << "######################################\n";
	std::cout << "#             0.退    出             #\n";
	std::cout << "######################################\n";
	std::cout << "请输入  >";

}
void Menu::txtOne() {
	system("cls");
	std::cout << "######################################\n";
	std::cout << "#             游戏规则               #\n";
	std::cout << "######################################\n";
	std::cout << "#                                    #\n";
	std::cout << "#     @->边界           W/w->上      #\n";
	std::cout << "#     #->墙             S/s->下      #\n";
	std::cout << "#     A->玩家           A/a->左      #\n";
	std::cout << "#     E->终点           D/d->右      #\n";
	std::cout << "#     X->道具           H->退出      #\n";
	std::cout << "#                                    #\n";
	std::cout << "#     道具会随机触发以下效果         #\n";
	std::cout << "#     1.随机方向打通格子             #\n";
	std::cout << "#     2.打通四周格子                 #\n";
	std::cout << "#     3.生成终点                     #\n";
	std::cout << "#     4.立即死亡                     #\n";
	std::cout << "#                                    #\n";
	std::cout << "######################################\n";
	std::cout << "#                                    #\n";
	std::cout << "#    本游戏是今经典走迷宫，当玩家到达#\n";
	std::cout << "#终点后会进入下一张迷宫，直至玩家手动#\n";
	std::cout << "#退出，本游戏会记录游戏时长，迷宫深度#\n";
	std::cout << "#来给玩家计分                        #\n";
	std::cout << "#                                    #\n";
	std::cout << "######################################\n";
	std::cout << "#           0.退    出               #\n";
	std::cout << "######################################\n";
	std::cout << "请输入  >";

}
void Menu::txtTwo() {
	system("cls");
	std::cout << "######################################\n";
	std::cout << "#               作者说明             #\n";
	std::cout << "######################################\n";
	std::cout << "#                                    #\n";
	std::cout << "#    本游戏由个人独立制作，通过控制台#\n";
	std::cout << "#的非阻塞输入来达到控制效果,本作还运 #\n";
	std::cout << "#用了前后双端交替地图打印的方法，避免#\n";
	std::cout << "#了，因为不断清除地图打印地图出现的闪#\n";
	std::cout << "#烁效果，欢迎大家一起挖bug           #\n";
	std::cout << "#                                    #\n";
	std::cout << "######################################\n";
	std::cout << "#作者联系方式：   3445229764@qq.com  #\n";
	std::cout << "######################################\n";
	std::cout << "#             0.退    出             #\n";
	std::cout << "######################################\n";
	std::cout << "请输入  >";

}
void Menu::rules() {
	system("cls");
	std::cout << "######################################\n";
	std::cout << "#             游戏规则               #\n";
	std::cout << "######################################\n";
	std::cout << "#     @->边界           W/w->上      #\n";
	std::cout << "#     #->墙             S/s->下      #\n";
	std::cout << "#     A->玩家           A/a->左      #\n";
	std::cout << "#     E->终点           D/d->右      #\n";
	std::cout << "#     X->道具           H->退出      #\n";
	std::cout << "#                                    #\n";
	std::cout << "#     道具会随机触发以下效果         #\n";
	std::cout << "#     1.随机方向打通格子             #\n";
	std::cout << "#     2.打通四周格子                 #\n";
	std::cout << "#     3.生成终点                     #\n";
	std::cout << "#     4.立即死亡                     #\n";
	std::cout << "######################################\n";
}
void Menu::timeMenu() {

}